Repository: denzil-muchangi/admobt
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr

# appTitle
source: AdMob Demo Showcase
es: Demostración de AdMob
fr: Démonstration AdMob

# welcomeTitle
source: Welcome to AdMob Demo
de: Willkommen bei AdMob Demo
es: Bienvenido a la Demo de AdMob
fr: Bienvenue dans la Démo AdMob

# welcomeSubtitle
source: Explore all AdMob ad formats in creative ways
de: Entdecken Sie alle AdMob-Anzeigenformate auf kreative Weise
es: Explora todos los formatos de anuncios de AdMob de manera creativa
fr: Explorez tous les formats d'annonces AdMob de manière créative

source: Banner Ads
de: Banner-Anzeigen
es: Anuncios Banner
fr: Bannières Publicitaires

source: Native Ads
de: Native Anzeigen
es: Anuncios Nativos
fr: Annonces Natives

source: Rewarded Ads
de: Belohnte Anzeigen
es: Anuncios Recompensados
fr: Annonces Récompensées

source: Interstitial Ads
de: Interstitial-Anzeigen
es: Anuncios Intersticiales
fr: Annonces Interstitielles

# allFormatsDemo
source: All Ad Formats Demo
de: Alle Formate Demo
es: Demo de Todos los Formatos
fr: Démo Tous Formats

source: Start Demo
de: Demo starten
es: Iniciar Demo
fr: Démarrer la Démo

# bannerShowcase
source: Banner Ad Showcase
de: Banner-Präsentation
es: Presentación de Banner
fr: Présentation des Bannières

source: Standard Banner
es: Banner Estándar
fr: Bannière Standard

# standardBannerDesc
source: 320x50 pixels - Most common format
de: 320x50 Pixel - Häufigstes Format
es: 320x50 píxeles - Formato más común
fr: 320x50 pixels - Format le plus courant

source: Large Banner
de: Großer Banner
es: Banner Grande
fr: Grande Bannière

# largeBannerDesc
source: 320x100 pixels - Better visibility
de: 320x100 Pixel - Bessere Sichtbarkeit
es: 320x100 píxeles - Mejor visibilidad
fr: 320x100 pixels - Meilleure visibilité

source: Medium Rectangle
de: Mittelgroßes Rechteck
es: Rectángulo Mediano
fr: Rectangle Moyen

# mediumRectangleDesc
source: 300x250 pixels - High engagement
de: 300x250 Pixel - Hohe Interaktion
es: 300x250 píxeles - Alto engagement
fr: 300x250 pixels - Engagement élevé

source: Leaderboard
de: Rangliste
es: Tabla de Posiciones
fr: Classement

# leaderboardDesc
source: 728x90 pixels - Tablet optimized
de: 728x90 Pixel - Tablet-optimiert
es: 728x90 píxeles - Optimizado para tablet
fr: 728x90 pixels - Optimisé pour tablette

source: Adaptive Banner
de: Adaptiver Banner
es: Banner Adaptativo
fr: Bannière Adaptative

# adaptiveBannerDesc
source: Responsive - Adapts to screen width
de: Responsiv - Passt sich der Bildschirmbreite an
es: Responsivo - Se adapta al ancho de pantalla
fr: Responsive - S'adapte à la largeur d'écran

# nativeIntegration
source: Native Ad Integration
de: Native Anzeigen-Integration
es: Integración de Anuncios Nativos
fr: Intégration d'Annonces Natives

source: Feed Native Ad
de: Native Anzeige im Feed
es: Anuncio Nativo en Feed
fr: Annonce Native dans le Flux

# feedNativeAdDesc
source: Seamlessly integrated in content feed
de: Nahtlos in den Content-Feed integriert
es: Integrado perfectamente en el feed de contenido
fr: Parfaitement intégré dans le flux de contenu

source: Article Native Ad
de: Native Anzeige im Artikel
es: Anuncio Nativo en Artículo
fr: Annonce Native dans l'Article

# articleNativeAdDesc
source: Looks like part of the article
de: Sieht aus wie Teil des Artikels
es: Parece parte del artículo
fr: Semble faire partie de l'article

source: Card Native Ad
de: Native Anzeige als Karte
es: Anuncio Nativo en Tarjeta
fr: Annonce Native en Carte

# cardNativeAdDesc
source: Styled as a featured card
de: Stilisiert als vorgestellte Karte
es: Estilizado como tarjeta destacada
fr: Stylisé comme une carte vedette

source: Custom Native Ad
de: Benutzerdefinierte Native Anzeige
es: Anuncio Nativo Personalizado
fr: Annonce Native Personnalisée

# customNativeAdDesc
source: Fully customized styling
de: Vollständig benutzerdefinierter Stil
es: Estilo completamente personalizado
fr: Style complètement personnalisé

# rewardedExperience
source: Rewarded Ad Experience
de: Belohnte Anzeigen-Erfahrung
es: Experiencia de Anuncios Recompensados
fr: Expérience d'Annonces Récompensées

source: Extra Lives
de: Extra Leben
es: Vidas Extra
fr: Vies Supplémentaires

# extraLivesDesc
source: Watch ad to get 3 extra lives
de: Sehen Sie sich eine Anzeige an, um 3 Extra-Leben zu erhalten
es: Mira un anuncio para obtener 3 vidas extra
fr: Regardez une annonce pour obtenir 3 vies supplémentaires

source: Premium Unlock
de: Premium freischalten
es: Desbloqueo Premium
fr: Déverrouillage Premium

# premiumUnlockDesc
source: Watch ad to unlock premium features
de: Sehen Sie sich eine Anzeige an, um Premium-Funktionen freizuschalten
es: Mira un anuncio para desbloquear funciones premium
fr: Regardez une annonce pour déverrouiller les fonctionnalités premium

source: Score Multiplier
de: Punkte-Multiplikator
es: Multiplicador de Puntuación
fr: Multiplicateur de Score

# scoreMultiplierDesc
source: Watch ad to get 2X score multiplier
de: Sehen Sie sich eine Anzeige an, um 2X Punkte-Multiplikator zu erhalten
es: Mira un anuncio para obtener multiplicador 2X
fr: Regardez une annonce pour obtenir un multiplicateur 2X

# interstitialTriggers
source: Interstitial Ad Triggers
de: Interstitial-Auslöser
es: Disparadores de Intersticial
fr: Déclencheurs Interstitiels

source: Button Click Trigger
de: Button-Klick Auslöser
es: Disparador de Clic en Botón
fr: Déclencheur de Clic sur Bouton

# buttonClickTriggerDesc
source: 33% chance to show ad when button is clicked
de: 33% Chance, Anzeige bei Button-Klick zu zeigen
es: 33% de probabilidad de mostrar anuncio al hacer clic
fr: 33% de chance d'afficher une annonce lors du clic

source: Time-Based Trigger
de: Zeitbasierter Auslöser
es: Disparador Basado en Tiempo
fr: Déclencheur Temporel

# timeBasedTriggerDesc
source: Shows ad after 5 seconds
de: Zeigt Anzeige nach 5 Sekunden
es: Muestra anuncio después de 5 segundos
fr: Affiche une annonce après 5 secondes

source: Manual Trigger
de: Manueller Auslöser
es: Disparador Manual
fr: Déclencheur Manuel

# manualTriggerDesc
source: Force show interstitial ad
de: Interstitial-Anzeige erzwingen
es: Forzar mostrar anuncio intersticial
fr: Forcer l'affichage d'une annonce interstitielle

source: Smart Triggers
de: Intelligente Auslöser
es: Disparadores Inteligentes
fr: Déclencheurs Intelligents

# smartTriggersDesc
source: Interstitial ads are intelligently triggered based on user behavior, ensuring optimal user experience while maximizing revenue.
de: Interstitial-Anzeigen werden intelligent basierend auf dem Nutzerverhalten ausgelöst, um optimale Nutzererfahrung bei gleichzeitiger Maximierung der Einnahmen zu gewährleisten.
es: Los anuncios intersticiales se activan inteligentemente basados en el comportamiento del usuario, asegurando una experiencia óptima mientras se maximiza la revenue.
fr: Les annonces interstitielles sont déclenchées intelligemment en fonction du comportement de l'utilisateur, assurant une expérience optimale tout en maximisant les revenus.

# completeExperience
source: Complete Ad Experience
de: Vollständige Anzeigen-Erfahrung
es: Experiencia Completa de Anuncios
fr: Expérience Complète d'Annonces

# experienceDesc
source: This section demonstrates how all ad formats work together in a real app scenario:
de: Dieser Abschnitt zeigt, wie alle Anzeigenformate in einem realen App-Szenario zusammenarbeiten:
es: Esta sección demuestra cómo todos los formatos de anuncios funcionan juntos en un escenario de aplicación real:
fr: Cette section démontre comment tous les formats d'annonces fonctionnent ensemble dans un scénario d'application réel :

source: Interactive Content
de: Interaktiver Inhalt
es: Contenido Interactivo
fr: Contenu Interactif

# unlockContent
source: Unlock Content with Ad
de: Inhalt mit Anzeige freischalten
es: Desbloquear Contenido con Anuncio
fr: Déverrouiller le Contenu avec une Annonce

source: Trigger Ad
de: Anzeige auslösen
es: Activar Anuncio
fr: Déclencher l'Annonce

source: Ad unavailable
de: Anzeige nicht verfügbar
es: Anuncio no disponible
fr: Annonce indisponible

# adNotReady
source: Ad not ready yet. Please try again.
de: Anzeige noch nicht bereit. Bitte versuchen Sie es erneut.
es: Anuncio no está listo aún. Por favor intenta de nuevo.
fr: Annonce pas encore prête. Veuillez réessayer.

# rewardedAdNotReady
source: Rewarded ad not ready yet. Please try again.
de: Belohnte Anzeige noch nicht bereit. Bitte versuchen Sie es erneut.
es: Anuncio recompensado no está listo aún. Por favor intenta de nuevo.
fr: Annonce récompensée pas encore prête. Veuillez réessayer.

# congratulations
source: Congratulations! You earned {amount} {type}!
de: Herzlichen Glückwunsch! Sie haben {amount} {type} verdient!
es: ¡Felicitaciones! ¡Ganaste {amount} {type}!
fr: Félicitations ! Vous avez gagné {amount} {type} !

source: Premium content unlocked!
de: Premium-Inhalt freigeschaltet!
es: ¡Contenido premium desbloqueado!
fr: Contenu premium déverrouillé !

# multiplierActivated
source: 2X multiplier activated!
de: 2X Multiplikator aktiviert!
es: ¡Multiplicador 2X activado!
fr: Multiplicateur 2X activé !

# extraLivesAdded
source: 3 extra lives added!
de: 3 Extra-Leben hinzugefügt!
es: ¡3 vidas extra añadidas!
fr: 3 vies supplémentaires ajoutées !

source: Action completed!
de: Aktion abgeschlossen!
es: ¡Acción completada!
fr: Action terminée !

# keepScrolling
source: Keep scrolling to trigger interstitial!
de: Scrollen Sie weiter, um Interstitial auszulösen!
es: ¡Sigue desplazándote para activar intersticial!
fr: Continuez à faire défiler pour déclencher l'interstitiel !

source: Ad dismissed
de: Anzeige abgewiesen
es: Anuncio descartado
fr: Annonce rejetée

source: Content unlocked!
de: Inhalt freigeschaltet!
es: ¡Contenido desbloqueado!
fr: Contenu déverrouillé !

source: Premium features activated!
de: Premium-Funktionen aktiviert!
es: ¡Funciones premium activadas!
fr: Fonctionnalités premium activées !

# adWillShow
source: Ad will show in 5 seconds...
de: Anzeige wird in 5 Sekunden angezeigt...
es: El anuncio se mostrará en 5 segundos...
fr: L'annonce s'affichera dans 5 secondes...

source: Exit App?
de: App beenden?
es: ¿Salir de la App?
fr: Quitter l'Application ?

# watchAdBeforeExit
source: Watch a quick ad before you go?
de: Möchten Sie eine kurze Anzeige ansehen, bevor Sie gehen?
es: ¿Quieres ver un anuncio rápido antes de irte?
fr: Regarder une annonce rapide avant de partir ?

source: Stay
de: Bleiben
es: Quedarse
fr: Rester

source: Exit with Ad
de: Mit Anzeige beenden
es: Salir con Anuncio
fr: Quitter avec Annonce

source: Advertisement
de: Werbung
es: Publicidad
fr: Publicité

source: Sponsored
de: Gesponsert
es: Patrocinado
fr: Sponsorisé

source: Featured
de: Vorgestellt
es: Destacado
fr: En Vedette

source: Out of Lives!
de: Keine Leben mehr!
es: ¡Sin Vidas!
fr: Plus de Vies !

# watchAdForLives
source: Watch an ad to get 3 extra lives!
de: Sehen Sie sich eine Anzeige an, um 3 Extra-Leben zu erhalten!
es: ¡Mira un anuncio para obtener 3 vidas extra!
fr: Regardez une annonce pour obtenir 3 vies supplémentaires !

source: Get Extra Lives
de: Extra-Leben erhalten
es: Obtener Vidas Extra
fr: Obtenir des Vies Supplémentaires

source: Premium Content
de: Premium-Inhalt
es: Contenido Premium
fr: Contenu Premium

# watchAdForPremium
source: Watch an ad to unlock exclusive content!
de: Sehen Sie sich eine Anzeige an, um exklusiven Inhalt freizuschalten!
es: ¡Mira un anuncio para desbloquear contenido exclusivo!
fr: Regardez une annonce pour déverrouiller du contenu exclusif !

source: Watch Ad & Unlock
de: Anzeige ansehen und freischalten
es: Ver Anuncio y Desbloquear
fr: Regarder l'Annonce et Déverrouiller

# bonusMultiplier
source: 2X Daily Bonus!
de: Täglicher 2X Bonus!
es: ¡Bono Diario 2X!
fr: Bonus Quotidien 2X !

# watchAdForMultiplier
source: Watch an ad to double your daily rewards!
de: Sehen Sie sich eine Anzeige an, um Ihre täglichen Belohnungen zu verdoppeln!
es: ¡Mira un anuncio para duplicar tus recompensas diarias!
fr: Regardez une annonce pour doubler vos récompenses quotidiennes !

# activateMultiplier
source: Activate 2X Bonus
de: 2X Bonus aktivieren
es: Activar Bono 2X
fr: Activer le Bonus 2X

source: Lives
de: Leben
es: Vidas
fr: Vies

source: Score
de: Punkte
es: Puntuación

source: Yes
de: Ja
es: Sí
fr: Oui

source: Scroll Threshold
de: Scroll-Schwellenwert
es: Umbral de Desplazamiento
fr: Seuil de Défilement

# scrollThresholdDesc
source: Shows after scrolling 1000px
de: Wird nach 1000px Scrolling angezeigt
es: Se muestra después de desplazar 1000px
fr: S'affiche après avoir fait défiler 1000px

source: No
de: Nein
fr: Non
